{
  "url": "https://ai.google.dev/",
  "title": "Gemini Developer API | Gemma open models  |  Google AI for Developers",
  "paragraphs": [
    "Unlock AI models to build innovative apps and transform development workflows with tools across platforms.",
    "Get started building with cutting-edge AI models and tools",
    "Build with cutting-edge AI models, like Gemini, from Google DeepMind.",
    "Unlock AI capabilities for your apps with a simple call to the Gemini API.",
    "Quickly evaluate AI models, develop prompts, and transform ideas into code.",
    "Build custom AI solutions and retain complete control. Tailor Gemma models, built from the same research and technology as Gemini, with your own data.",
    "Build and deploy edge ML solutions across mobile, web, and embedded applications, from simple APIs to custom pipelines, with support across all major frameworks.",
    "Unlock low latency and cost effective generative AI features while keeping data on-device.",
    "Integrate AI models like Gemini Nano into web apps with Chrome's built-in web platform APIs.",
    "Build trusted and secure AI with guidance for responsible design, development, and deployment of models and applications.",
    "Tools and guidance to design, build, and evaluate open AI models responsibly.",
    "Build and deploy secure, responsible AI applications with the help of Google's Secure AI Framework (SAIF).",
    "Agents",
    "Analysis and insights",
    "Code generation",
    "Code chat",
    "Gemini empowers you to be more productive by acting as your coding agent. It can plan and execute tasks, freeing you to focus on what matters most.",
    "Improve code quality and fix issues with code analysis. Get insights, suggestions, and code snippets within your existing development environment.",
    "Gemini adds AI-powered code completion with natural language understanding to create entire code blocks from your descriptions, revolutionizing your development workflow.",
    "Ask development questions and receive responses that help you reduce errors, solve problems, and become a better developer. Gemini understands the context of your environment to give you the best responses for your questions.",
    "Tldraw",
    "Prototyping a new natural language computing experience on an infinite canvas with Gemini 2.0",
    "Rooms",
    "Unlocking richer avatar interactions with Gemini 2.0 text and audio capabilities",
    "Toonsutra",
    "Leveraging contextual multilingual translation abilities of Gemini 2.0 to make comics and webtoons accessible to audiences in India across regional languages.",
    "Viggle",
    "Experimenting with Gemini 2.0 to create virtual characters and audio narration for their AI powered video platform",
    "Sublayer",
    "See how the Ruby-based AI agent framework empowers developer teams to be more productive with the power of Gemini models.",
    "Sourcegraph",
    "Learn how Cody AI saw big quality gains using Gemini's massive context window.",
    "AgentOps",
    "Explore how AgentOps provides cost-effective and powerful LLM-powered agent observability for enterprises using Gemini API.",
    "Tap into the power of our community forum. Get answers, build together, and be part of the conversation."
  ],
  "code_blocks": [],
  "tables": []
}